# Notebook with env = cw01

In [1]:
print ("Hello World!")

Hello World!

In [ ]:
pip install ipython-sql==0.4.1

In [ ]:
pip install ibm_db

In [ ]:
pip install sqlalchemy==1.4.47

In [ ]:
pip install ibm_db_sa

In [2]:
import sys,os,os.path
os.environ['IBM_DB_HOME']='C:\Program Files\IBM\SQLLIB'

In [3]:
import ibm_db

In [4]:
import ibm_db_sa

In [5]:
import sqlalchemy

In [6]:
%load_ext sql

In [7]:
%sql ibm_db_sa://db2admin:l0nep1ne@localhost:50000/SAMPLE

In [ ]:
%sql select name from sysibm.systables

In [9]:
%sql ibm_db_sa://IBMUSER:SYS1@192.168.1.171:5045/DALLASD

In [10]:
%sql select * from Q.ORG

 * ibm_db_sa://IBMUSER:***@192.168.1.171:5045/DALLASD
   ibm_db_sa://db2admin:***@localhost:50000/SAMPLE
Done.

[(10, 'HEAD OFFICE', 160, 'CORPORATE', 'NEW YORK'),
 (15, 'NEW ENGLAND', 50, 'EASTERN', 'BOSTON'),
 (20, 'MID ATLANTIC', 10, 'EASTERN', 'WASHINGTON'),
 (38, 'SOUTH ATLANTIC', 30, 'EASTERN', 'ATLANTA'),
 (42, 'GREAT LAKES', 100, 'MIDWEST', 'CHICAGO'),
 (51, 'PLAINS', 140, 'MIDWEST', 'DALLAS'),
 (66, 'PACIFIC', 270, 'WESTERN', 'SAN FRANCISCO'),
 (84, 'MOUNTAIN', 290, 'WESTERN', 'DENVER')]

In [11]:
%%sql 
update Q.ORG set deptname = 'NEW DEPT NAME' where deptnumb = 66 ;
select * from Q.ORG ;

 * ibm_db_sa://IBMUSER:***@192.168.1.171:5045/DALLASD
   ibm_db_sa://db2admin:***@localhost:50000/SAMPLE
Done.
1 rows affected.
Done.

[(10, 'HEAD OFFICE', 160, 'CORPORATE', 'NEW YORK'),
 (15, 'NEW ENGLAND', 50, 'EASTERN', 'BOSTON'),
 (20, 'MID ATLANTIC', 10, 'EASTERN', 'WASHINGTON'),
 (38, 'SOUTH ATLANTIC', 30, 'EASTERN', 'ATLANTA'),
 (42, 'GREAT LAKES', 100, 'MIDWEST', 'CHICAGO'),
 (51, 'PLAINS', 140, 'MIDWEST', 'DALLAS'),
 (66, 'NEW DEPT NAME', 270, 'WESTERN', 'SAN FRANCISCO'),
 (84, 'MOUNTAIN', 290, 'WESTERN', 'DENVER')]